import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","name","type","weaponType","quality","iconGuid","cd","cost","damage","describe"],["","","","","","","","","",""],[1001,"三连击",1,1,1,"98203",0,0,[30],"循环斩出左斩、右斩、下劈。对面前小范围进行打击。造成伤害，对小怪造成僵直。"],[1002,"三连击",1,1,1,"98203",0,0,[30],"循环斩出左斩、右斩、下劈。对面前小范围进行打击。造成伤害，对小怪造成僵直。"],[1003,"三连击",1,1,1,"98203",0,0,[40],"循环斩出左斩、右斩、下劈。对面前小范围进行打击。造成伤害，对小怪造成僵直。"],[1004,"挥砍",1,1,1,"312017",5,20,[120],"使用武器向前方扇形范围进行重重的挥砍，对敌人造成伤害。",269246],[1005,"剑气波",1,1,1,"312027",5,20,[140],"将自身的气力附着于武器之上并向前挥出，对处于一条直线的敌人造成伤害。",279672,84958],[1006,"血爆",1,1,1,"143678",20,20,[3000],"向周围抛出多道锁链，将周围的敌人抓取到身边（对BOSS无效），并击碎敌人防御力10％。"],[1007,"冲锋",1,1,1,"312012",10,30,[330],"低头向前冲锋4s，冲锋过程中可以略微调整方向，冲锋结束时略微增加自身防御力。"],[1008,"跳斩",1,1,1,"163773",3,25,[260],"高高跳起跃向指定地点，然后重重砸下，对范围内敌人造成伤害并施加眩晕。",269092],[1009,"拔刀斩",1,1,1,"312020",9,40,[480],"收刀入鞘，凝聚全身的力气拔刀并借势旋转一周，对自身周围所有敌人造成伤害。",279742,95654],[1010,"旋风斩",1,1,1,"234347",12,50,[170,170,170,170],"将力气灌入双臂，狠狠的挥舞武器旋转5s，每秒对周围敌人造成伤害，旋转过程中可以移动。"],[1011,"唤剑术",1,1,2,"143719",90,55,[120],"精神沟通天地，接下来的20s内，每次攻击会召唤一把灵剑攻击敌方造成伤害。"],[1012,"蕴剑术",1,1,2,"146060",90,55,null,"将精神力附着于剑身之上，使剑更加锋利。接下来30s内，所有伤害无视敌方50％防御力。"],[1013,"天地一刀斩",1,1,2,"143696",1,75,[3000,1260,1260,1260],"携万钧之势一刀斩下，对前方超大范围造成一次超高伤害。",281700,297932],[1014,"后跳",1,1,1,"37792",0.5,10,null,null],[2001,"冰锥术",1,2,1,"163644",0,0,[80],"发射一道可以在敌人之间弹射两次的冰锥，造成伤害并减速敌人10％。"],[2002,"火球术",1,2,1,"163638",2,15,[110],"发射一枚火球，命中敌人时产生爆炸，造成伤害并击退敌人。"],[2003,"冰环术",1,2,1,"163680",5,25,[150],"以自身为中心释放冰雪之力，冻结周围敌人并造成伤害。对精英以及BOSS效果降低。"],[2004,"暴风雪",1,2,1,"163642",7,35,[70,70,70],"改变指定地区环境，降下3s的暴风雪，对区域内敌人持续造成伤害并减速敌人。"],[2005,"闪电链",1,2,1,"143723",7,30,[200],"向敌人发射一道最多弹射6次的闪电链，优先弹射新敌人，僵直敌人并造成伤害。对同一敌人伤害递减20％。"],[2006,"万雷引",1,2,1,"143716",12,35,[75,75,75,75,75],"在指定怪物身上种下雷核，持续牵引周围怪物5s并对周围所有敌人造成伤害。"],[2007,"炎爆术",1,2,1,"163681",10,50,[550],"蓄力发射一枚大型火球，命中敌人时向内坍缩随后爆炸，吸引并伤害大范围敌人。"],[2008,"陨石术",1,2,1,"143679",15,50,[420,100,100,100],"以法杖牵引召来天外陨石，砸向指定地点。陨石落地造成伤害，之后会在地面形成3s岩浆区域，持续造成伤害。"],[2009,"冰霜闪现",1,2,1,"163727",8,10,null,"向指示器方向闪烁一段距离，落地时对周围敌人造成减速并增加自身10％防御力。"],[2010,"冰封万里",1,2,2,"143697",90,80,[500,2300],"向冰雪之神借力，瞬间冻结大范围内的所有敌人，在每个敌人头顶凝成一只冰矛重重砸下，造成高额伤害并破冰。"],[2011,"雷神之怒",1,2,2,"146056",75,60,[100,300],"向雷电之神借力，召唤出一朵20s的雷云，持续攻击周围敌人。每次释放技能，雷云释放一次高伤雷击。"],[2012,"气定神闲",1,2,2,"143673",90,60,null,"向火焰之神借力，一定时间内增加自身暴击率15％，增加伤害20％，降低所有技能cd40％，降低技能消耗40％。"],[10001,"轻盈光环",2,0,3,"163636",0,0,null,"增加角色自身20％移动速度。"],[10002,"暴怒光环",2,0,3,"143704",0,0,null,"增加角色自身15％暴击率。"],[10003,"魔力光环",2,0,3,"145159",0,0,null,"增加角色自身5/s的法力恢复速度。"],[10004,"力量光环",2,0,3,"163645",0,0,null,"增加角色20％攻击伤害。"],[10005,"活力光环",2,0,3,"143703",0,0,null,"增加角色自身300/s的血量恢复速度。"]];
export interface ISkillObjElement extends IElementBase{
 	/**ID*/
	id:number
	/**名称*/
	name:string
	/**技能种类：&#10;1.普通技能&#10;2.被动技能*/
	type:number
	/**关联武器种类：&#10;1.大剑&#10;2.法杖&#10;&#10;3.通用&#10*/
	weaponType:number
	/**技能品级：&#10;1.普通技能&#10;2.终极技能&#10;3.光环技能*/
	quality:number
	/**技能图标*/
	iconGuid:string
	/**技能CD*/
	cd:number
	/**消耗*/
	cost:number
	/**伤害百分比（如果是多段攻击填数组)
100代表百分之100的伤害*/
	damage:Array<number>
	/**技能描述*/
	describe:string
 } 
export class SkillObjConfig extends ConfigBase<ISkillObjElement>{
	constructor(){
		super(EXCELDATA);
	}

}