import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","name","type","quality","model","atk","matk","str","int","effect1","effect2","effect3","effect4","icon","stackMax"],["","","","","","","","","","","","","","",""],[1001,"生锈的铁剑",1,1,"ED1D823242771BAA249294A58DE4710A",[15,20],[7,10],0,0,null,null,null,null,"150552",1,null,1],[1002,"简易的铁剑",1,1,"ED1D823242771BAA249294A58DE4710A",[22,26],[20,24],0,0,null,null,null,null,"150552",1,null,1],[1003,"残旧的铁剑",1,1,"ED1D823242771BAA249294A58DE4710A",[24,28],[18,21],0,0,null,null,null,null,"150552",1,null,2],[1004,"破损的铁剑",1,1,"ED1D823242771BAA249294A58DE4710A",[29,34],[21,25],0,0,null,null,null,null,"150552",1,null,3],[1005,"磨损的铁剑",1,1,"102928",[53,62],[40,47],0,0,null,null,null,null,"140337",1,null,6],[1006,"生锈的战士剑",1,1,"102928",[86,101],[64,76],0,0,null,null,null,null,"140337",1,null,10],[1007,"生锈的印度剑",1,1,"102928",[118,139],[88,104],0,0,"104",null,null,null,"140337",1,null,14],[1008,"钝锋的双刃剑",1,1,"103057",[151,178],[113,133],0,0,"133",null,null,null,"150610",1,null,18],[1010,"生锈的波刃剑",1,1,"31732",[184,216],[138,162],0,0,"162",null,null,null,"47796",1,null,22],[1012,"劣质的哈莉斯之剑",1,1,"29055",[216,254],[162,191],0,0,"191",null,null,null,"47815",1,null,26],[1013,"破旧的宽刃长剑",1,1,"29055",[249,293],[187,220],0,0,"220",null,null,null,"47815",1,null,30],[1014,"古老的骑士长剑",1,1,"103058",[281,331],[211,248],0,0,"248",null,null,null,"150552",1,null,34],[1015,"古老的雕纹剑",1,1,"103058",[315,370],[235,277],0,0,"277",null,null,null,"150552",1,null,38],[1016,"破旧的执行剑",1,1,"103058",[347,408],[260,306],0,0,"306",null,null,null,"150552",1,null,42],[1017,"重剑",1,2,"103058",[53,62],[40,47],0,0,"47",null,null,null,"150552",1,null,5],[1018,"普通剑",1,2,"103058",[61,72],[46,54],0,0,"54",null,null,null,"150552",1,null,6],[1019,"新式剑",1,2,"103058",[70,82],[52,61],0,0,"61",null,null,null,"150552",1,null,7],[1020,"锋利的剑",1,2,"103058",[86,101],[65,76],0,0,"76",null,null,null,"150552",1,null,9],[1021,"步兵剑",1,2,"103058",[94,110],[71,83],0,0,"83",null,null,null,"150552",1,null,10],[1022,"新式步兵剑",1,2,"103058",[102,120],[77,90],0,0,"90",null,null,null,"150552",1,null,11],[1023,"印度古剑",1,2,"103058",[127,149],[95,112],0,0,"112",null,null,null,"150552",1,null,14],[1024,"锋利的印度古剑",1,2,"103058",[134,158],[101,119],0,0,"119",null,null,null,"150552",1,null,15],[1025,"双刃巨剑",1,2,"103058",[159,187],[119,140],11,0,"140",null,null,null,"150552",1,null,18],[1026,"改良的双刃巨剑",1,2,"103058",[167,197],[126,148],12,0,"148",null,null,null,"150552",1,null,19],[1027,"波刃长剑",1,2,"103058",[192,226],[144,169],14,0,"169",null,null,null,"150552",1,null,22],[1028,"精致的波刃长剑",1,2,"103058",[200,235],[150,176],14,0,"176",null,null,null,"150552",1,null,23],[1029,"哈莉斯之剑",1,2,"103058",[224,264],[168,198],17,0,"198",null,null,null,"150552",1,null,26],[1030,"坚韧的哈莉斯之剑",1,2,"103058",[233,274],[174,205],17,0,"205",null,null,null,"150552",1,null,27],[1031,"宽刃长剑",1,2,"103058",[257,302],[193,227],18,0,"227",null,null,null,"150552",1,null,30],[1032,"新式宽刃长剑",1,2,"103058",[265,312],[199,234],19,0,"234",null,null,null,"150552",1,null,31],[1033,"骑士长剑",1,2,"103058",[290,341],[218,256],21,0,"256",null,null,null,"150552",1,null,34],[1034,"钢铁骑士长剑",1,2,"103058",[298,350],[224,263],21,0,"263",null,null,null,"150552",1,null,35],[1035,"雕纹剑",1,2,"103058",[322,379],[241,284],23,0,"284",null,null,null,"150552",1,null,38],[1036,"精致的雕纹剑",1,2,"103058",[331,389],[248,292],24,0,"292",null,null,null,"150552",1,null,39],[1037,"执行巨剑",1,2,"103058",[355,418],[266,313],26,0,"313",null,null,null,"150552",1,null,42],[1038,"石中剑",1,4,"4D82B7F549634FA3E420FA80E2FB3CD3",[400,450],[200,225],170,90,"技能伤增加15％","攻击力增加15％","防御力增加15％","血量增加15％","150562",1],[1039,"破空剑",1,4,"31734",[415,470],[209,237],177,95,"暴击率增加10％","爆伤增加20％","剑气波数量+1","怒气爆发CD-2秒","166600",1],[1040,"流光星陨剑",1,4,"7A67352D4812323CC8F2C1A7EFEE2AD1",[415,470],[209,237],183,95,"攻击时有20%的概率召唤陨石","攻击力增加10%",null,null,"318943",1],[2002,"陨星杖",2,4,"179329",[200,225],[400,450],90,170,"技能伤增加20％","技能CD减少20％","释放技能时10％几率召唤陨石","释放技能时1％几率召唤大陨石","194519",1],[3001,"随时会断的弓",3,1,"26755",[14,18],[13,16],5,5,null,null,null,null,"26755",1],[3002,"月神的弓弦",3,4,"278406",[350,410],[330,395],130,130,"攻击速度增加10％","攻击力增加20％","命中时使敌人减速10％","箭矢附带冰蓝色拖尾","278406",1]];
export interface IWeaponObjElement extends IElementBase{
 	/**ID*/
	id:number
	/**名称*/
	name:string
	/**武器种类：&#xA;1.刀剑;2.法杖&#xA;3.弓弩*/
	type:number
	/**品级：&#xA;1.普通&#xA;2.高级&#xA;3.稀有&#xA;4.史诗*/
	quality:number
	/**模型*/
	model:string
	/**物理攻击力范围*/
	atk:Array<number>
	/**魔法攻击力范围*/
	matk:Array<number>
	/**力量*/
	str:number
	/**智力*/
	int:number
	/**效果1描述*/
	effect1:string
	/**效果2描述*/
	effect2:string
	/**效果3描述*/
	effect3:string
	/**效果4描述*/
	effect4:string
	/**图标资源id*/
	icon:string
	/**堆叠数量上限*/
	stackMax:number
 } 
export class WeaponObjConfig extends ConfigBase<IWeaponObjElement>{
	constructor(){
		super(EXCELDATA);
	}

}